In [49]:
import pandas as pd

In [50]:
data1 = {
    'emp_id' :[1001, 1002, 1003, 1004, 1005, 1006, 1007] ,
    'name': ['Alex', 'Bret', 'Carla', 'Don', 'Emmett', 'Frank', 'Gina'],
    'age': [21, 22, 23, 24, 25, 26, 27]
}

df1 = pd.DataFrame(data1)
df1

   emp_id    name  age
0    1001    Alex   21
1    1002    Bret   22
2    1003   Carla   23
3    1004     Don   24
4    1005  Emmett   25
5    1006   Frank   26
6    1007    Gina   27

In [51]:

data2 = {
    'emp_id' :[1005, 1006, 1007, 1008, 1009, 1010, 1011] ,
    'name': ['Happy', 'Inita', 'John', 'Kate', 'Leyman', 'Martha', 'Nigel'],
    'age': [27, 28, 29, 30, 31, 32, 33]
}

df2 = pd.DataFrame(data2)
df2

   emp_id    name  age
0    1005   Happy   27
1    1006   Inita   28
2    1007    John   29
3    1008    Kate   30
4    1009  Leyman   31
5    1010  Martha   32
6    1011   Nigel   33

In [52]:
df_merged = df1.merge(df2, on="emp_id")
df_merged

   emp_id  name_x  age_x name_y  age_y
0    1005  Emmett     25  Happy     27
1    1006   Frank     26  Inita     28
2    1007    Gina     27   John     29

In [53]:
df_merged = df1.merge(df2, left_on="emp_id", right_on="age")
df_merged

Empty DataFrame
Columns: [emp_id_x, name_x, age_x, emp_id_y, name_y, age_y]
Index: []

In [54]:
df_merged = df1.merge(df2, how='outer')
df_merged

    emp_id    name  age
0     1001    Alex   21
1     1002    Bret   22
2     1003   Carla   23
3     1004     Don   24
4     1005  Emmett   25
5     1006   Frank   26
6     1007    Gina   27
7     1005   Happy   27
8     1006   Inita   28
9     1007    John   29
10    1008    Kate   30
11    1009  Leyman   31
12    1010  Martha   32
13    1011   Nigel   33

In [55]:
df_merged = df1.merge(df2, how="left", on="emp_id")
df_merged

   emp_id  name_x  age_x name_y  age_y
0    1001    Alex     21    NaN    NaN
1    1002    Bret     22    NaN    NaN
2    1003   Carla     23    NaN    NaN
3    1004     Don     24    NaN    NaN
4    1005  Emmett     25  Happy   27.0
5    1006   Frank     26  Inita   28.0
6    1007    Gina     27   John   29.0

In [56]:
df_merged = df1.merge(df2, how="right", on="emp_id")
df_merged

   emp_id  name_x  age_x  name_y  age_y
0    1005  Emmett   25.0   Happy     27
1    1006   Frank   26.0   Inita     28
2    1007    Gina   27.0    John     29
3    1008     NaN    NaN    Kate     30
4    1009     NaN    NaN  Leyman     31
5    1010     NaN    NaN  Martha     32
6    1011     NaN    NaN   Nigel     33

In [57]:
df_merged = df1.merge(df2, how="inner", on="emp_id")
df_merged

   emp_id  name_x  age_x name_y  age_y
0    1005  Emmett     25  Happy     27
1    1006   Frank     26  Inita     28
2    1007    Gina     27   John     29

In [58]:
df_merged = df1.merge(df2, on=["emp_id", "age"], how="outer")
df_merged

    emp_id  name_x  age  name_y
0     1001    Alex   21     NaN
1     1002    Bret   22     NaN
2     1003   Carla   23     NaN
3     1004     Don   24     NaN
4     1005  Emmett   25     NaN
5     1006   Frank   26     NaN
6     1007    Gina   27     NaN
7     1005     NaN   27   Happy
8     1006     NaN   28   Inita
9     1007     NaN   29    John
10    1008     NaN   30    Kate
11    1009     NaN   31  Leyman
12    1010     NaN   32  Martha
13    1011     NaN   33   Nigel

In [59]:
df_merged = df1.merge(df2, on="emp_id", suffixes=("_data1", "_data2"))
df_merged

   emp_id name_data1  age_data1 name_data2  age_data2
0    1005     Emmett         25      Happy         27
1    1006      Frank         26      Inita         28
2    1007       Gina         27       John         29

In [60]:
df_merged = df1.merge(df2, left_index=True, right_index=True)
df_merged

   emp_id_x  name_x  age_x  emp_id_y  name_y  age_y
0      1001    Alex     21      1005   Happy     27
1      1002    Bret     22      1006   Inita     28
2      1003   Carla     23      1007    John     29
3      1004     Don     24      1008    Kate     30
4      1005  Emmett     25      1009  Leyman     31
5      1006   Frank     26      1010  Martha     32
6      1007    Gina     27      1011   Nigel     33

In [61]:
df1.join(df2, lsuffix="_data1", rsuffix="_data2")

   emp_id_data1 name_data1  age_data1  emp_id_data2 name_data2  age_data2
0          1001       Alex         21          1005      Happy         27
1          1002       Bret         22          1006      Inita         28
2          1003      Carla         23          1007       John         29
3          1004        Don         24          1008       Kate         30
4          1005     Emmett         25          1009     Leyman         31
5          1006      Frank         26          1010     Martha         32
6          1007       Gina         27          1011      Nigel         33

In [62]:
pd.concat([df1, df2])

   emp_id    name  age
0    1001    Alex   21
1    1002    Bret   22
2    1003   Carla   23
3    1004     Don   24
4    1005  Emmett   25
5    1006   Frank   26
6    1007    Gina   27
0    1005   Happy   27
1    1006   Inita   28
2    1007    John   29
3    1008    Kate   30
4    1009  Leyman   31
5    1010  Martha   32
6    1011   Nigel   33

In [63]:
pd.concat([df1, df2], axis=1)

   emp_id    name  age  emp_id    name  age
0    1001    Alex   21    1005   Happy   27
1    1002    Bret   22    1006   Inita   28
2    1003   Carla   23    1007    John   29
3    1004     Don   24    1008    Kate   30
4    1005  Emmett   25    1009  Leyman   31
5    1006   Frank   26    1010  Martha   32
6    1007    Gina   27    1011   Nigel   33

In [64]:
pd.concat([df1, df2],axis=0, join="inner")

   emp_id    name  age
0    1001    Alex   21
1    1002    Bret   22
2    1003   Carla   23
3    1004     Don   24
4    1005  Emmett   25
5    1006   Frank   26
6    1007    Gina   27
0    1005   Happy   27
1    1006   Inita   28
2    1007    John   29
3    1008    Kate   30
4    1009  Leyman   31
5    1010  Martha   32
6    1011   Nigel   33

In [65]:
pd.concat([df1, df2], keys=["data1", "data2"])

         emp_id    name  age
data1 0    1001    Alex   21
      1    1002    Bret   22
      2    1003   Carla   23
      3    1004     Don   24
      4    1005  Emmett   25
      5    1006   Frank   26
      6    1007    Gina   27
data2 0    1005   Happy   27
      1    1006   Inita   28
      2    1007    John   29
      3    1008    Kate   30
      4    1009  Leyman   31
      5    1010  Martha   32
      6    1011   Nigel   33

In [66]:
pd.concat([df1, df2], ignore_index=True)

    emp_id    name  age
0     1001    Alex   21
1     1002    Bret   22
2     1003   Carla   23
3     1004     Don   24
4     1005  Emmett   25
5     1006   Frank   26
6     1007    Gina   27
7     1005   Happy   27
8     1006   Inita   28
9     1007    John   29
10    1008    Kate   30
11    1009  Leyman   31
12    1010  Martha   32
13    1011   Nigel   33